#  Load the csv file

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('USA_cars_datasets.csv.txt')
df

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2494,2494,7800,nissan,versa,2019,clean vehicle,23609.0,red,3n1cn7ap9kl880319,167722715,california,usa,1 days left
2495,2495,9200,nissan,versa,2018,clean vehicle,34553.0,silver,3n1cn7ap5jl884088,167762225,florida,usa,21 hours left
2496,2496,9200,nissan,versa,2018,clean vehicle,31594.0,silver,3n1cn7ap9jl884191,167762226,florida,usa,21 hours left
2497,2497,9200,nissan,versa,2018,clean vehicle,32557.0,black,3n1cn7ap3jl883263,167762227,florida,usa,2 days left
2498,2498,9200,nissan,versa,2018,clean vehicle,31371.0,silver,3n1cn7ap4jl884311,167762228,florida,usa,21 hours left

#  Operations on df

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.head()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [5]:
df.head(2)

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left

# Select column using indexing or column name

In [6]:
df['price']

0        6300
1        2899
2        5350
3       25000
4       27700
        ...
2494     7800
2495     9200
2496     9200
2497     9200
2498     9200
Name: price, Length: 2499, dtype: int64

# how to Deal with missing /null values

In [7]:
df.isnull()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2494,False,False,False,False,False,False,False,False,False,False,False,False,False
2495,False,False,False,False,False,False,False,False,False,False,False,False,False
2496,False,False,False,False,False,False,False,False,False,False,False,False,False
2497,False,False,False,False,False,False,False,False,False,False,False,False,False
2498,False,False,False,False,False,False,False,False,False,False,False,False,False

In [8]:
df.isnull().sum()

Unnamed: 0      0
price           0
brand           0
model           0
year            0
title_status    0
mileage         0
color           0
vin             0
lot             0
state           0
country         0
condition       0
dtype: int64

#  Drop unwanted columns

In [35]:
del df['lot']

In [36]:
del df['condition']

In [38]:
del df['Unnamed: 0']

In [42]:
data_Frame=df.head()
data_Frame

,price,brand,model,year,title_status,mileage,color,state,country
0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,new jersey,usa
1,2899,ford,se,2011,clean vehicle,190552.0,silver,tennessee,usa
2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,georgia,usa
3,25000,ford,door,2014,clean vehicle,64146.0,blue,virginia,usa
4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,florida,usa

# use of Unique()

In [11]:
df['brand']

0          toyota
1            ford
2           dodge
3            ford
4       chevrolet
          ...
2494       nissan
2495       nissan
2496       nissan
2497       nissan
2498       nissan
Name: brand, Length: 2499, dtype: object

In [12]:
df['brand'].unique()

array(['toyota', 'ford', 'dodge', 'chevrolet', 'gmc', 'chrysler', 'kia',
       'buick', 'infiniti', 'mercedes-benz', 'jeep', 'bmw', 'cadillac',
       'hyundai', 'mazda', 'honda', 'heartland', 'jaguar', 'acura',
       'harley-davidson', 'audi', 'lincoln', 'lexus', 'nissan', 'land',
       'maserati', 'peterbilt', 'ram'], dtype=object)

In [13]:
len(df['brand'].unique())

28

In [15]:
len(df['model'].unique())

127

In [16]:
df['year'].unique()

array([2008, 2011, 2018, 2014, 2010, 2017, 2009, 2013, 2015, 2020, 2016,
       1973, 2003, 2019, 2002, 2000, 2001, 2005, 2012, 2006, 2007, 1998,
       2004, 1994, 1997, 1996, 1999, 1984, 1995, 1993], dtype=int64)

In [19]:
df['color'].unique()

array(['black', 'silver', 'blue', 'red', 'white', 'gray', 'orange',
       'brown', 'no_color', 'gold', 'charcoal', 'turquoise', 'beige',
       'green', 'dark blue', 'maroon', 'phantom black', 'yellow',
       'color:', 'light blue', 'toreador red', 'bright white clearcoat',
       'billet silver metallic clearcoat', 'black clearcoat',
       'jazz blue pearlcoat', 'purple',
       'ruby red metallic tinted clearcoat', 'triple yellow tri-coat',
       'competition orange', 'off-white', 'shadow black',
       'magnetic metallic', 'ingot silver metallic', 'ruby red',
       'royal crimson metallic tinted clearcoat', 'kona blue metallic',
       'oxford white', 'lightning blue', 'ingot silver',
       'white platinum tri-coat metallic', 'guard',
       'tuxedo black metallic', 'tan', 'burgundy', 'super black',
       'cayenne red', 'morningsky blue', 'pearl white', 'glacier white'],
      dtype=object)

In [20]:
len(df['color'].unique())

49

In [21]:
df['state'].unique()

array(['new jersey', 'tennessee', 'georgia', 'virginia', 'florida',
       'texas', 'california', 'north carolina', 'ohio', 'new york',
       'pennsylvania', 'south carolina', 'michigan', 'washington',
       'arizona', 'utah', 'kentucky', 'massachusetts', 'nebraska',
       'ontario', 'missouri', 'minnesota', 'oklahoma', 'connecticut',
       'indiana', 'arkansas', 'kansas', 'wyoming', 'colorado', 'illinois',
       'wisconsin', 'mississippi', 'maryland', 'oregon', 'west virginia',
       'nevada', 'rhode island', 'louisiana', 'alabama', 'new mexico',
       'idaho', 'new hampshire', 'montana', 'vermont'], dtype=object)

In [22]:
df['country'].unique()

array([' usa', ' canada'], dtype=object)

# AVG Price calculation

In [23]:
df['price']

0        6300
1        2899
2        5350
3       25000
4       27700
        ...
2494     7800
2495     9200
2496     9200
2497     9200
2498     9200
Name: price, Length: 2499, dtype: int64

In [24]:
len(df['price'])

2499

In [28]:
avg_price=df['price'].sum()/len(df['price'])
int(avg_price)

18767

In [29]:
avg_mileage=df['mileage'].sum()/len(df['mileage'])
avg_mileage

52298.685474189675

In [43]:
df['price'].min()

0

In [46]:
df['price'].max()

84900

In [45]:
df['mileage'].max()

1017936.0

#  Car brands in Toyota

In [47]:
df['brand']

0          toyota
1            ford
2           dodge
3            ford
4       chevrolet
          ...
2494       nissan
2495       nissan
2496       nissan
2497       nissan
2498       nissan
Name: brand, Length: 2499, dtype: object

In [49]:
toyota=df['brand']=='toyota'
toyota

0        True
1       False
2       False
3       False
4       False
        ...
2494    False
2495    False
2496    False
2497    False
2498    False
Name: brand, Length: 2499, dtype: bool

In [50]:
toyota.sum()

1

In [53]:
toyota1=df[df['brand']=='toyota']
toyota1

,price,brand,model,year,title_status,mileage,color,state,country
0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,new jersey,usa

# car brands in ford

In [56]:
ford=df[df['brand']=='ford']
ford

,price,brand,model,year,title_status,mileage,color,state,country
1,2899,ford,se,2011,clean vehicle,190552.0,silver,tennessee,usa
3,25000,ford,door,2014,clean vehicle,64146.0,blue,virginia,usa
9,5250,ford,mpv,2017,clean vehicle,63418.0,black,texas,usa
14,20700,ford,door,2013,clean vehicle,100757.0,black,virginia,usa
18,5210,ford,mpv,2017,clean vehicle,35714.0,white,texas,usa
...,...,...,...,...,...,...,...,...,...
2199,13800,ford,fusion,2019,clean vehicle,29345.0,white,north carolina,usa
2200,56000,ford,srw,2018,clean vehicle,25371.0,black,pennsylvania,usa
2201,13800,ford,fusion,2019,clean vehicle,30054.0,silver,north carolina,usa
2202,45800,ford,srw,2018,clean vehicle,11173.0,white,pennsylvania,usa
2203,13800,ford,fusion,2019,clean vehicle,30902.0,no_color,north carolina,usa

len(ford)

# >>>Automation

# No. of cars in each brand

In [57]:
df['brand'].unique()

array(['toyota', 'ford', 'dodge', 'chevrolet', 'gmc', 'chrysler', 'kia',
       'buick', 'infiniti', 'mercedes-benz', 'jeep', 'bmw', 'cadillac',
       'hyundai', 'mazda', 'honda', 'heartland', 'jaguar', 'acura',
       'harley-davidson', 'audi', 'lincoln', 'lexus', 'nissan', 'land',
       'maserati', 'peterbilt', 'ram'], dtype=object)

In [59]:
for brand in df['brand'].unique():
    print(brand,':',len(df[df['brand']==brand]))

toyota : 1
ford : 1235
dodge : 432
chevrolet : 297
gmc : 42
chrysler : 18
kia : 13
buick : 13
infiniti : 12
mercedes-benz : 10
jeep : 30
bmw : 17
cadillac : 10
hyundai : 15
mazda : 2
honda : 12
heartland : 5
jaguar : 1
acura : 3
harley-davidson : 1
audi : 4
lincoln : 2
lexus : 2
nissan : 312
land : 4
maserati : 1
peterbilt : 4
ram : 1

# No. of cars in each model

In [60]:
for model in df['model'].unique():
    print(model,':',len(df[df['model']==model]))

cruiser : 1
se : 1
mpv : 87
door : 651
1500 : 39
pk : 5
malibu : 12
coupe : 6
wagon : 30
forte : 2
encore : 3
sorento : 5
doors : 148
chassis : 4
q70 : 1
camaro : 6
convertible : 1
vans : 2
srw : 38
compass : 6
enclave : 2
300 : 6
cherokee : 3
pacifica : 3
x3 : 2
equinox : 18
challenger : 44
m : 1
colorado : 12
focus : 9
durango : 64
escape : 39
charger : 42
explorer : 39
f-150 : 219
3500 : 4
caravan : 102
van : 46
dart : 1
2500 : 8
esv : 1
cutaway : 12
el : 3
edge : 34
series : 8
flex : 33
srx : 1
cab : 8
pickup : 15
vehicl : 1
trax : 8
tahoe : 9
suburban : 16
cargo : 2
drw : 10
fiesta : 14
impala : 12
soul : 1
elantra : 1
pioneer : 1
trail : 1
traverse : 6
country : 2
sundance : 1
road/street : 1
nautilus : 1
gx : 1
q5 : 1
gle : 2
sportage : 1
5 : 1
sport : 40
discovery : 1
acadia : 1
ghibli : 1
glc : 1
e-class : 1
truck : 4
utility : 1
limited : 1
sl-class : 1
cx-3 : 1
2500hd : 1
sonic : 2
corvette : 4
mdx : 1
xt5 : 1
fusion : 65
mustang : 29
passenger : 3
volt : 2
spark : 1
cruze : 2
ld : 3
journey : 61
transit : 41
ranger : 6
taurus : 10
max : 41
energi : 1
expedition : 28
bus : 2
ecosport : 7
f-750 : 1
d : 2
dr : 1
hybrid : 5
suv : 1
connect : 1
f-650 : 3
sentra : 28
altima : 21
frontier : 14
rogue : 54
maxima : 3
versa : 34
note : 2
armada : 4
pathfinder : 22
titan : 5
sedan : 4
juke : 1
murano : 5
xterra : 1
kicks : 1
xd : 1
nvp : 1

# No. of cars of particular colors

In [61]:
for clr in df['color'].unique():
    print(clr,':',len(df[df['color']==clr]))

black : 516
silver : 300
blue : 151
red : 192
white : 707
gray : 395
orange : 20
brown : 15
no_color : 61
gold : 19
charcoal : 18
turquoise : 1
beige : 5
green : 24
dark blue : 1
maroon : 1
phantom black : 1
yellow : 9
color: : 5
light blue : 1
toreador red : 1
bright white clearcoat : 2
billet silver metallic clearcoat : 3
black clearcoat : 2
jazz blue pearlcoat : 1
purple : 1
ruby red metallic tinted clearcoat : 2
triple yellow tri-coat : 3
competition orange : 1
off-white : 2
shadow black : 5
magnetic metallic : 6
ingot silver metallic : 4
ruby red : 1
royal crimson metallic tinted clearcoat : 1
kona blue metallic : 1
oxford white : 4
lightning blue : 1
ingot silver : 1
white platinum tri-coat metallic : 2
guard : 1
tuxedo black metallic : 2
tan : 1
burgundy : 1
super black : 3
cayenne red : 2
morningsky blue : 1
pearl white : 1
glacier white : 1

# No. of cars in respective states

In [62]:
for state in df['state'].unique():
    print(state,':',len(df[df['state']==state]))

new jersey : 87
tennessee : 26
georgia : 51
virginia : 90
florida : 246
texas : 214
california : 190
north carolina : 146
ohio : 31
new york : 58
pennsylvania : 299
south carolina : 64
michigan : 169
washington : 14
arizona : 33
utah : 10
kentucky : 9
massachusetts : 27
nebraska : 4
ontario : 7
missouri : 46
minnesota : 119
oklahoma : 71
connecticut : 25
indiana : 14
arkansas : 12
kansas : 4
wyoming : 1
colorado : 21
illinois : 113
wisconsin : 94
mississippi : 24
maryland : 4
oregon : 27
west virginia : 21
nevada : 85
rhode island : 2
louisiana : 11
alabama : 17
new mexico : 4
idaho : 2
new hampshire : 4
montana : 1
vermont : 2

# No. of cars manufactured in respective year

In [63]:
for year in df['year'].unique():
    print(year,':',len(df[df['year']==year]))

2008 : 18
2011 : 23
2018 : 395
2014 : 104
2010 : 13
2017 : 377
2009 : 11
2013 : 86
2015 : 196
2020 : 48
2016 : 203
1973 : 1
2003 : 9
2019 : 892
2002 : 2
2000 : 4
2001 : 5
2005 : 6
2012 : 72
2006 : 8
2007 : 6
1998 : 4
2004 : 6
1994 : 2
1997 : 2
1996 : 2
1999 : 1
1984 : 1
1995 : 1
1993 : 1